In [6]:
pip install pandas

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pandas in c:\programdata\anaconda3\lib\site-packages (1.4.2)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2021.3)
Requirement already satisfied: numpy>=1.18.5 in c:\programdata\anaconda3\lib\site-packages (from pandas) (1.21.5)
Requirement already satisfied: six>=1.5 in c:\programdata\anaconda3\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [7]:
import pandas as pd
import numpy as np

### Data structure in pandas module

In [8]:
# there are 3 data structures provided by pandas module, which are as 
# series 1

#a series is a very similar to numpy array. what differentiates the numpy array from a series , is that a series can have axis
#labels, meaning it can be indexed by a label

la= ['a','b','c']

In [9]:
pd.Series()

C:\Users\cdac\AppData\Local\Temp\ipykernel_11244\3134564496.py:1: FutureWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  pd.Series()

Series([], dtype: float64)

In [10]:
# using list
m=[12,34,12]
a=pd.Series(data=m,index=la)

In [11]:
pd.Series(a,la)

a    12
b    34
c    12
dtype: int64

In [12]:
pd.Series(la)

0    a
1    b
2    c
dtype: object

In [13]:
ser2= pd.Series([1,2,3,4],index=["ptk","kullu","shimla","lahore"])
ser1= pd.Series([1,2,3,4],index=["stk","thullu","vimla","sahore"])

In [14]:
ser2["ptk"]

1

In [15]:
s=ser2*ser1

In [16]:
r=[2,7]
ser=pd.Series(r,copy=False)
ser.iloc[0]=20
r

[2, 7]

In [17]:
ser

0    20
1     7
dtype: int64

In [18]:
ser

0    20
1     7
dtype: int64

# DATA FRAMES

In [19]:
pd.DataFrame() # create an empty data frames

Empty DataFrame
Columns: []
Index: []

In [20]:
pf=pd.DataFrame(np.random.randn(5,4),index='A B C D E'.split(),columns='w x y z'.split())
pf

          w         x         y         z
A -1.289929  0.615150  1.557582 -0.092269
B -0.068161  0.684197  0.039607 -0.034470
C -1.623423 -0.059606 -0.768728 -0.721839
D -0.006173  0.748359  0.405567 -1.080588
E -0.452279 -0.192797  0.282460  0.718419

In [21]:
df={
    "Name":['Rahul','Archana','Garish','Anjali','Anmol','Monika'],
   "Subjects":['Python','c++','java','php','ruby','javascript'],
   "Marks":[70,77,75,67,85,90],
   "Highest Marks":[34,67,98,23,90,99]
}

In [22]:
d=pd.DataFrame(df)

In [23]:
d.head(2)

      Name Subjects  Marks  Highest Marks
0    Rahul   Python     70             34
1  Archana      c++     77             67

In [24]:
d.dtypes

Name             object
Subjects         object
Marks             int64
Highest Marks     int64
dtype: object

In [25]:
d.index

RangeIndex(start=0, stop=6, step=1)

In [26]:
d.columns

Index(['Name', 'Subjects', 'Marks', 'Highest Marks'], dtype='object')

# stastical summary of records

In [27]:
d.describe()

           Marks  Highest Marks
count   6.000000       6.000000
mean   77.333333      68.500000
std     8.778762      33.243044
min    67.000000      23.000000
25%    71.250000      42.250000
50%    76.000000      78.500000
75%    83.000000      96.000000
max    90.000000      99.000000

In [28]:
d['Marks'].describe()

count     6.000000
mean     77.333333
std       8.778762
min      67.000000
25%      71.250000
50%      76.000000
75%      83.000000
max      90.000000
Name: Marks, dtype: float64

In [29]:
d.describe(include="all")  #get all columns of a dataframe regardless of data types.

         Name Subjects      Marks  Highest Marks
count       6        6   6.000000       6.000000
unique      6        6        NaN            NaN
top     Rahul   Python        NaN            NaN
freq        1        1        NaN            NaN
mean      NaN      NaN  77.333333      68.500000
std       NaN      NaN   8.778762      33.243044
min       NaN      NaN  67.000000      23.000000
25%       NaN      NaN  71.250000      42.250000
50%       NaN      NaN  76.000000      78.500000
75%       NaN      NaN  83.000000      96.000000
max       NaN      NaN  90.000000      99.000000

In [30]:
a=pd.DataFrame({'category':pd.Categorical(['d','e','f']),
               'numeric':[1,2,3],
               'object':['a','b','c']})
a.describe(include=['category'])

       category
count         3
unique        3
top           d
freq          1

In [31]:
d[['Name','Subjects']]

      Name    Subjects
0    Rahul      Python
1  Archana         c++
2   Garish        java
3   Anjali         php
4    Anmol        ruby
5   Monika  javascript

In [32]:
# dataframe columns are just series

type(d["Subjects"])

pandas.core.series.Series

In [33]:
d[0:3]

      Name Subjects  Marks  Highest Marks
0    Rahul   Python     70             34
1  Archana      c++     77             67
2   Garish     java     75             98

In [34]:
d
d.iloc[2]

Name             Garish
Subjects           java
Marks                75
Highest Marks        98
Name: 2, dtype: object

In [35]:
d.loc[2,"Subjects"]     # define both index and name

'java'

In [36]:
# creating a new coloums

d['new_col']=d['Marks']+d['Highest Marks']
d

      Name    Subjects  Marks  Highest Marks  new_col
0    Rahul      Python     70             34      104
1  Archana         c++     77             67      144
2   Garish        java     75             98      173
3   Anjali         php     67             23       90
4    Anmol        ruby     85             90      175
5   Monika  javascript     90             99      189

In [37]:
d.drop('new_col',axis=1)

      Name    Subjects  Marks  Highest Marks
0    Rahul      Python     70             34
1  Archana         c++     77             67
2   Garish        java     75             98
3   Anjali         php     67             23
4    Anmol        ruby     85             90
5   Monika  javascript     90             99

In [38]:
d     # the new col will not drop form orginal until we specify inplace=true

      Name    Subjects  Marks  Highest Marks  new_col
0    Rahul      Python     70             34      104
1  Archana         c++     77             67      144
2   Garish        java     75             98      173
3   Anjali         php     67             23       90
4    Anmol        ruby     85             90      175
5   Monika  javascript     90             99      189

In [39]:
#d.drop(4,axis=0,inplace=True)         # it will originallly remove the 4th row
d

      Name    Subjects  Marks  Highest Marks  new_col
0    Rahul      Python     70             34      104
1  Archana         c++     77             67      144
2   Garish        java     75             98      173
3   Anjali         php     67             23       90
4    Anmol        ruby     85             90      175
5   Monika  javascript     90             99      189

In [40]:
d['Marks']>70

0    False
1     True
2     True
3    False
4     True
5     True
Name: Marks, dtype: bool

In [41]:
d[d['Name'].isin(['Rahul','Monika'])] # asking specific names form data set

     Name    Subjects  Marks  Highest Marks  new_col
0   Rahul      Python     70             34      104
5  Monika  javascript     90             99      189

In [42]:
d[d["Marks"]>70]["Name"]

1    Archana
2     Garish
4      Anmol
5     Monika
Name: Name, dtype: object

In [43]:
d[d["Highest Marks"]>35][['Name','Subjects']]

      Name    Subjects
1  Archana         c++
2   Garish        java
4    Anmol        ruby
5   Monika  javascript

In [44]:
d[ (d["Marks"]>70) | (d['Highest Marks']>35)   ]

      Name    Subjects  Marks  Highest Marks  new_col
1  Archana         c++     77             67      144
2   Garish        java     75             98      173
4    Anmol        ruby     85             90      175
5   Monika  javascript     90             99      189

In [45]:
d[ (d["Marks"]>70) & (d['Highest Marks']>35)   ]

      Name    Subjects  Marks  Highest Marks  new_col
1  Archana         c++     77             67      144
2   Garish        java     75             98      173
4    Anmol        ruby     85             90      175
5   Monika  javascript     90             99      189

# Renaming the coloumn

In [46]:
d.rename(columns={"Highest Marks":"Avg Marks"},inplace=True)
d

      Name    Subjects  Marks  Avg Marks  new_col
0    Rahul      Python     70         34      104
1  Archana         c++     77         67      144
2   Garish        java     75         98      173
3   Anjali         php     67         23       90
4    Anmol        ruby     85         90      175
5   Monika  javascript     90         99      189

## DATA wrangling (14/03/2023)

In [61]:
d={'Student_id':['1','2','3','4','5'],
   'Student_name':['preeti','kajol','akshay','ajay','anil'],
   'Marks':[60,55,70,80,75]
  }

df1=pd.DataFrame(d)
df1

  Student_id Student_name  Marks
0          1       preeti     60
1          2        kajol     55
2          3       akshay     70
3          4         ajay     80
4          5         anil     75

In [62]:
d2={'Student_id':['1','2','3','4','5'],
   'Student_name':['anchal','manik','sahil','ajay','sahil'],
   'Marks':[60,55,70,80,75]
  }

df2=pd.DataFrame(d2)

df2

  Student_id Student_name  Marks
0          1       anchal     60
1          2        manik     55
2          3        sahil     70
3          4         ajay     80
4          5        sahil     75

## merging

In [63]:
pd.merge(df1,df2,on="Student_id")

  Student_id Student_name_x  Marks_x Student_name_y  Marks_y
0          1         preeti       60         anchal       60
1          2          kajol       55          manik       55
2          3         akshay       70          sahil       70
3          4           ajay       80           ajay       80
4          5           anil       75          sahil       75

In [65]:
group=df2.groupby('Student_name')

In [68]:
g=group.get_group('sahil')
g

  Student_id Student_name  Marks
2          3        sahil     70
4          5        sahil     75

In [67]:
g.min()

Student_id          3
Student_name    sahil
Marks              70
dtype: object

In [69]:
g.max()

Student_id          5
Student_name    sahil
Marks              75
dtype: object

In [70]:
g.count()

Student_id      2
Student_name    2
Marks           2
dtype: int64

In [72]:
group.describe()

             Marks
             count  mean       std   min    25%   50%    75%   max
Student_name
ajay           1.0  80.0       NaN  80.0  80.00  80.0  80.00  80.0
anchal         1.0  60.0       NaN  60.0  60.00  60.0  60.00  60.0
manik          1.0  55.0       NaN  55.0  55.00  55.0  55.00  55.0
sahil          2.0  72.5  3.535534  70.0  71.25  72.5  73.75  75.0

# concatination

In [73]:
pd.concat([df1,df2])

  Student_id Student_name  Marks
0          1       preeti     60
1          2        kajol     55
2          3       akshay     70
3          4         ajay     80
4          5         anil     75
0          1       anchal     60
1          2        manik     55
2          3        sahil     70
3          4         ajay     80
4          5        sahil     75

# Joining

### joining is a convinient method for combining the columns of two potentially differently-indexed DAtaFrames into a single result DataFrame

In [80]:
left=pd.DataFrame({'A':['A0','A1','A2'],
                  'B':['B0','B1','B2']},
                 index=['K0','K1','K3'])

right=pd.DataFrame({'C':['C0','C1','C2'],
                  'D':['D0','D1','D2']},
                 index=['K0','K1','K2'])
left

     A   B
K0  A0  B0
K1  A1  B1
K3  A2  B2

In [81]:
right

     C   D
K0  C0  D0
K1  C1  D1
K2  C2  D2

In [82]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1   C1   D1
K3  A2  B2  NaN  NaN

In [83]:
right.join(left)

     C   D    A    B
K0  C0  D0   A0   B0
K1  C1  D1   A1   B1
K2  C2  D2  NaN  NaN

In [84]:
left.join(right,how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1   C1   D1
K2  NaN  NaN   C2   D2
K3   A2   B2  NaN  NaN

In [85]:
left.join(right,how='left')

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1   C1   D1
K3  A2  B2  NaN  NaN

## Reshaping the data frame

In [86]:
ddf=pd.DataFrame(d)
ddf

  Student_id Student_name  Marks
0          1       preeti     60
1          2        kajol     55
2          3       akshay     70
3          4         ajay     80
4          5         anil     75

In [87]:
ddf.melt()

        variable   value
0     Student_id       1
1     Student_id       2
2     Student_id       3
3     Student_id       4
4     Student_id       5
5   Student_name  preeti
6   Student_name   kajol
7   Student_name  akshay
8   Student_name    ajay
9   Student_name    anil
10         Marks      60
11         Marks      55
12         Marks      70
13         Marks      80
14         Marks      75

In [89]:
frame=pd.DataFrame(np.random.randn(4,4),index='A B C D'.split(),columns='W X Y Z'.split())
frame

          W         X         Y         Z
A  0.211659 -1.642133  1.470219 -0.182241
B -0.848708 -0.603654  0.766220 -0.358865
C  0.888868 -0.956419  3.587705  0.583049
D  0.057476 -0.048228 -1.499494  0.122295

In [91]:
# rest the index .....to default 0 ,1,2
frame.reset_index()

  index         W         X         Y         Z
0     A  0.211659 -1.642133  1.470219 -0.182241
1     B -0.848708 -0.603654  0.766220 -0.358865
2     C  0.888868 -0.956419  3.587705  0.583049
3     D  0.057476 -0.048228 -1.499494  0.122295

In [93]:
newindex= 'p q r s'.split()

In [103]:
frame['pubg']=newindex     # add new columns in dataframe
frame

               W         X         Y         Z pubg
states
p       0.211659 -1.642133  1.470219 -0.182241    p
q      -0.848708 -0.603654  0.766220 -0.358865    q
r       0.888868 -0.956419  3.587705  0.583049    r
s       0.057476 -0.048228 -1.499494  0.122295    s

In [105]:
# set actual index values with new values

frame.set_index('pubg')

             W         X         Y         Z
pubg
p     0.211659 -1.642133  1.470219 -0.182241
q    -0.848708 -0.603654  0.766220 -0.358865
r     0.888868 -0.956419  3.587705  0.583049
s     0.057476 -0.048228 -1.499494  0.122295

In [106]:
frame.set_index('pubg',inplace=True)
frame

             W         X         Y         Z
pubg
p     0.211659 -1.642133  1.470219 -0.182241
q    -0.848708 -0.603654  0.766220 -0.358865
r     0.888868 -0.956419  3.587705  0.583049
s     0.057476 -0.048228 -1.499494  0.122295

### multindex and index hericharchary

In [110]:
# index levels

outside=['A1','A1','A1','A2','A2','A2']
inside=[1,2,3,1,2,3]

index=list(zip(outside,inside))
index=pd.MultiIndex.from_tuples(index)

In [114]:
df=pd.DataFrame(np.random.randn(6,2),index=index,columns=['b','c'])
df

             b         c
A1 1  0.164846 -0.395742
   2  0.186697  0.234360
   3 -1.272005 -0.539680
A2 1  0.832818  0.017429
   2 -1.309668 -0.386757
   3 -0.728864 -0.059019

In [125]:
# calling index hierachary

df.loc['A1'].loc[2]  # calllings inside index

            b         c
Num
1    0.164846 -0.395742
2    0.186697  0.234360
3   -1.272005 -0.539680

In [120]:
df.index.names  # we have no names for index right now

FrozenList([None, None])

In [122]:
df.index.names=['Group','Num']
df

                  b         c
Group Num
A1    1    0.164846 -0.395742
      2    0.186697  0.234360
      3   -1.272005 -0.539680
A2    1    0.832818  0.017429
      2   -1.309668 -0.386757
      3   -0.728864 -0.059019

In [123]:
df.xs('A1')

            b         c
Num
1    0.164846 -0.395742
2    0.186697  0.234360
3   -1.272005 -0.539680

In [130]:
df.xs(1,level="Num")

              b         c
Group
A1     0.164846 -0.395742
A2     0.832818  0.017429

# Handle missing data

In [131]:
# missing data can potentially give you a wrong result when you analyze data

In [ ]:
import numpy as np
import pandas as pd

In [133]:
df= pd.DataFrame({'A':[1,2,np.nan,4,5],
                  'B':[5,3,np.nan,6,7],
                  'C':[1,2,3,3,2],
                  'D':[np.nan,6,8,np.nan,6],
                  'E':[4,5,6,7,8],
                  'F':['abc','fgh','dh','pq',np.nan]
                 })

In [134]:
df

     A    B  C    D  E    F
0  1.0  5.0  1  NaN  4  abc
1  2.0  3.0  2  6.0  5  fgh
2  NaN  NaN  3  8.0  6   dh
3  4.0  6.0  3  NaN  7   pq
4  5.0  7.0  2  6.0  8  NaN

In [137]:
# check for nul values

In [140]:
df.isnull()

       A      B      C      D      E      F
0  False  False  False   True  False  False
1  False  False  False  False  False  False
2   True   True  False  False  False  False
3  False  False  False   True  False  False
4  False  False  False  False  False   True

In [142]:
# remove 
df.dropna()

     A    B  C    D  E    F
1  2.0  3.0  2  6.0  5  fgh

In [143]:
df.dropna(axis=0)

     A    B  C    D  E    F
1  2.0  3.0  2  6.0  5  fgh

In [144]:
df.dropna(axis=1)

   C  E
0  1  4
1  2  5
2  3  6
3  3  7
4  2  8

In [145]:
df.dropna(thresh=1)

     A    B  C    D  E    F
0  1.0  5.0  1  NaN  4  abc
1  2.0  3.0  2  6.0  5  fgh
2  NaN  NaN  3  8.0  6   dh
3  4.0  6.0  3  NaN  7   pq
4  5.0  7.0  2  6.0  8  NaN

In [146]:
df.dropna(thresh=5)

     A    B  C    D  E    F
0  1.0  5.0  1  NaN  4  abc
1  2.0  3.0  2  6.0  5  fgh
3  4.0  6.0  3  NaN  7   pq
4  5.0  7.0  2  6.0  8  NaN

In [149]:
df.dropa(subset=["D"])

AttributeError: 'DataFrame' object has no attribute 'dropa'

In [150]:
df.fillna(value="fillvalue")

           A          B  C          D  E          F
0        1.0        5.0  1  fillvalue  4        abc
1        2.0        3.0  2        6.0  5        fgh
2  fillvalue  fillvalue  3        8.0  6         dh
3        4.0        6.0  3  fillvalue  7         pq
4        5.0        7.0  2        6.0  8  fillvalue

In [151]:
df.fillna(5)

     A    B  C    D  E    F
0  1.0  5.0  1  5.0  4  abc
1  2.0  3.0  2  6.0  5  fgh
2  5.0  5.0  3  8.0  6   dh
3  4.0  6.0  3  5.0  7   pq
4  5.0  7.0  2  6.0  8    5

In [152]:
df

     A    B  C    D  E    F
0  1.0  5.0  1  NaN  4  abc
1  2.0  3.0  2  6.0  5  fgh
2  NaN  NaN  3  8.0  6   dh
3  4.0  6.0  3  NaN  7   pq
4  5.0  7.0  2  6.0  8  NaN

In [153]:
# replace only for specified column

In [155]:
df["D"].fillna(value=5)

0    5.0
1    6.0
2    8.0
3    5.0
4    6.0
Name: D, dtype: float64

In [156]:
# fill with a agregated value

In [157]:
df['D'].fillna(df["D"].mean())  # fill values with mean

0    6.666667
1    6.000000
2    8.000000
3    6.666667
4    6.000000
Name: D, dtype: float64

In [158]:
df

     A    B  C    D  E    F
0  1.0  5.0  1  NaN  4  abc
1  2.0  3.0  2  6.0  5  fgh
2  NaN  NaN  3  8.0  6   dh
3  4.0  6.0  3  NaN  7   pq
4  5.0  7.0  2  6.0  8  NaN

In [160]:
df["D"].fillna(df["D"].mode()[0])

0    6.0
1    6.0
2    8.0
3    6.0
4    6.0
Name: D, dtype: float64

In [161]:
df['D'].fillna(df["D"].mode()[0])

0    6.0
1    6.0
2    8.0
3    6.0
4    6.0
Name: D, dtype: float64

In [163]:
df.fillna(method="bfill")

     A    B  C    D  E    F
0  1.0  5.0  1  6.0  4  abc
1  2.0  3.0  2  6.0  5  fgh
2  4.0  6.0  3  8.0  6   dh
3  4.0  6.0  3  6.0  7   pq
4  5.0  7.0  2  6.0  8  NaN

In [164]:
df.bfill(axis=1)

     A    B    C    D    E    F
0  1.0  5.0    1    4    4  abc
1  2.0  3.0    2  6.0    5  fgh
2    3    3    3  8.0    6   dh
3  4.0  6.0    3    7    7   pq
4  5.0  7.0  2.0  6.0  8.0  NaN

In [165]:
df.fillna(method="ffill",axis=0)

     A    B  C    D  E    F
0  1.0  5.0  1  NaN  4  abc
1  2.0  3.0  2  6.0  5  fgh
2  2.0  3.0  3  8.0  6   dh
3  4.0  6.0  3  8.0  7   pq
4  5.0  7.0  2  6.0  8   pq

In [168]:

df.ffill(axis=0,inplace=True)
df

     A    B  C    D  E    F
0  1.0  5.0  1  NaN  4  abc
1  2.0  3.0  2  6.0  5  fgh
2  2.0  3.0  3  8.0  6   dh
3  4.0  6.0  3  8.0  7   pq
4  5.0  7.0  2  6.0  8   pq

In [169]:
#info on unique values

df["D"].unique()

array([nan,  6.,  8.])

In [170]:
df["A"].nunique()

4

In [172]:
df["A"].value_counts()

2.0    2
1.0    1
4.0    1
5.0    1
Name: A, dtype: int64

In [176]:
#applyinf function
def  sq(x):
    return x*2;

df['A'].apply(sq)

0     2.0
1     4.0
2     4.0
3     8.0
4    10.0
Name: A, dtype: float64

In [178]:
df['F',apply(len)

SyntaxError: unexpected EOF while parsing (2148745167.py, line 1)

In [180]:
df.max()

A    5.0
B    7.0
C      3
D    8.0
E      8
F     pq
dtype: object

### PERMANETLY REMOVING COLUMSN

In [183]:
del df['D']
df

     A    B  C  E    F
0  1.0  5.0  1  4  abc
1  2.0  3.0  2  5  fgh
2  2.0  3.0  3  6   dh
3  4.0  6.0  3  7   pq
4  5.0  7.0  2  8   pq

# Reading a file

In [206]:
csv=pd.read_excel("Excel_Sample.xlsx") # read excel file
csv.to_csv('sample excel',index=False)  # save excel file into sample excel file

In [207]:
csv.to_excel('sample excel',index=False)

ValueError: No engine for filetype: ''